0/htf/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{

	#includeEtc "caseDicts/setConstraintTypes"

	top
	{
		type		fixedValue;
		value		uniform 400;
	}
	
	bot
	{
		type		inletOutlet;//zeroGradient;
		value		$internalField;
		inletValue	$internalField;
	}
	
	symWall
	{
		type		symmetryPlane;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	}

	htf_to_pipe
	{
		        	type            compressible::turbulentTemperatureCoupledBaffleMixed;
        	value           $internalField;
        	Tnbr            T;
        	kappaMethod     fluidThermo;
	}

	

	
		
	

	
}


// ************************************************************************* //
