0/htf/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/bottomAir";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);//(0.01 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

	top
	{
		type		fixedValue;//noSlip;
		value		uniform (0 -1e-6 0 );//-1e-5);
	}

	bot
	{
		type		pressureInletOutletVelocity;//noSlip;
		value		$internalField;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	}


	htf_to_pipe
	{
		type		noSlip;
	}
}


// ************************************************************************* //
