0/htf/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

	/*top
	{
		type		zeroGradient;
		value		$internalField;
	}

	bot
	{
		type		zeroGradient;
		type		$internalField;
	}

	symWall
	{
		type		symmetryPlane;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	}

	htf_to_pipe
	{
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    	}*/

	".*"
	{
		type            calculated;
		value           $internalField;
	}
				
}


// ************************************************************************* //
