0/htf/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

	top
	{
		type		fixedFluxPressure;//calculated; 
		value		$internalField;//uniform 0;
	}

	bot
	{
		type		fixedValue;//fixedFluxPressure;//calculated;
		value		$internalField;//uniform 0;
	}

	front
	{
		type		empty;
	}
		
	back
	{
		type		empty;
	}

	htf_to_pipe
	{
		type		fixedFluxPressure;//calculated;
		value		$internalField;//uniform 0;
	}
}


// ************************************************************************* //
