0/pcm/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/bottomAir";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.01 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    /*".*"
    {
        type            noSlip;
    }*/

	top
	{
		type		noSlip;
	}

	bot
	{
		type		noSlip;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	}

	right
	{
		type		noSlip;
	}

	pcm_to_pipe
	{
		type		noSlip;
	}

}


// ************************************************************************* //
