0/pcm/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/rightSolid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    /*"(min|max)(X|Y|Z)"
    {
        type            calculated;
        value           $internalField;
    }
    "rightSolid_to_.*"
    {
        type            calculated;
        value           uniform 0;
    }*/

    /*".*"
    {
        type            calculated;
        value           $internalField;
    }*/

	top
	{
		type		calculated; 
		value		uniform 0;
	}

	bot
	{
		type		calculated;
		value		uniform 0;
	}

	front
	{
		type		empty;
	}
		
	back
	{
		type		empty;
	}

	right
	{
		type		calculated;
		value		uniform 0;
	}

	pcm_to_pipe
	{
		type		calculated;
		value		uniform 0;
	}



	
}


// ************************************************************************* //
