0/pipe/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/leftSolid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    //"(min|max)(X|Y|Z)"
	top	
	{
		type            calculated;
		value           $internalField;
	}

	bot
	{
		type		calculated;
		value		$internalField;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	}
		
	right
	{
		type		calculated;
		value		$internalField;
	}

	symWall
	{
		type		symmetryPlane;		
	}


	
	pipe_to_htf
    	{
		type            calculated;
		value           uniform 0;
    	}

	pipe_to_pcm
	{
		type		calculated;
		value		uniform 0;
	}

}


// ************************************************************************* //
