constant/htf/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/bottomAir";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//engine oil T = 300k

/*thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;//perfectFluid;//perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        //molWeight       18;//28.9;
    }
    thermodynamics
    {	
        Cp             1.909;
	Hf		0;
    }
    transport
    {
        mu              1.8e-05;
        Pr              0.7;
    }
}*/

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       3000;//18;
    }
    equationOfState
    {
        rho             932;//1000;
    }
    thermodynamics
    {
        Cp              1.3;//4181;
        Hf              0;
    }
    transport
    {
        mu              0.044;//959e-6;
        Pr              0.33;//6.62;
    }
}


// ************************************************************************* //
