constant/pcm/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pc
{
        type            solidificationMeltingSource;
        active          yes;//on;
        //selectionMode   all;//cellZone;
        //cellZone        meltZone;
        solidificationMeltingSourceCoeffs
        {
	    selectionMode   cellZone;//all;
	    cellZone	    pcm;
	    Tsol            309;
            Tmelt           311;
            L               147e+3;
            thermoMode      thermo;
            beta            1e-04;
            rhoRef          900;
	    //Cp		    CpRef;
	    //CpRef	    381.5;
	    Cu		    1.6e+6;
	    q	 	    1e-3;
        }
}


// ************************************************************************* //
