system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin 0;
xmax 0.2;
ymin 0;
ymax 0.4;//0.5;
zmin 0;
zmax 0.001;//0.001;

nx 160;//80;
ny  320;//160;

vertices
(
    ($xmin  $ymin  $zmin) //0
    ($xmax  $ymin  $zmin) //1
    ($xmax  $ymax  $zmin) //2
    ($xmin  $ymax  $zmin) //3
    ($xmin  $ymin  $zmax) //4
    ($xmax  $ymin  $zmax) //5
    ($xmax  $ymax  $zmax) //6
    ($xmin  $ymax  $zmax) //7




);

	
blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	top
	{
		type wall;
			
		faces
		(
			(3 2 7 6)
		);
	}

	bot
	{
		type wall;

		faces
		(
			(0 1 5 4)
		);
	}

	symWall
	{
		type symmetryPlane;

		faces
		(
			(0 3 7 4)
		);
	}

	front
	{
		type empty;

		faces
		(
			(4 5 6 7)
		);
	}

	back
	{
		type empty;
		
		faces
		(
			(0 3 2 1)
		);
	}

	right
	{
		type wall;

		faces
		(
			(1 2 6 5)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
