system/pcm/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        /*solver          PCG
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;*/
	solver 		diagonal;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-10;//1e-7;
        relTol           0.01;

        smoother         DIC;//GaussSeidel;

    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|k|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.1;
    }

    "(U|h|k|epsilon|R)Final"
    {
        $U;
        //tolerance        1e-07;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         1;//2;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors	2;

}

relaxationFactors
{
    equations
    {
        "h.*"           0.8;
        "U.*"           1;
    }
}
// ************************************************************************* //
